{
    "movie_details": {
        "movie_card_105": {
            "description": "Eighties teenager Marty McFly is accidentally sent back in time to 1955, inadvertently disrupting his parents' first meeting and attracting his mother's romantic interest. Marty must repair the damage to history by rekindling his parents' romance and - with the help of his eccentric inventor friend Doc Brown - return to 1985.",
            "director": "Robert Zemeckis",
            "dop": "Dean Cundey",
            "imdb_id": "0088763",
            "poster_path": "https://image.tmdb.org/t/p/original/fNOH9f1aA7XRTzl1sAOx9iF553Q.jpg",
            "release_date": "1985-07-03",
            "stars": "Michael J. Fox, Christopher Lloyd, Lea Thompson, Crispin Glover, Thomas F. Wilson, Claudia Wells, Marc McClure, Wendie Jo Sperber, George DiCenzo, Frances Lee McCain, James Tolkan, J.J. Cohen, Casey Siemaszko, Billy Zane, Harry Waters, Jr., Donald Fullilove, Lisa Freeman, Cristen Kauffman, Elsa Raven, Will Hare, Ivy Bethune, Jason Marin, Katherine Britton, Jason Hervey, Maia Brewton, Courtney Gains, Richard L. Duran, Jeff O'Haco, Johnny Green, Jamie Abbott, Norman Alden, Read Morgan, Sachi Parker, Robert Krantz, Gary Riley, Karen Petrasek, George Buck Flower, Tommy Thomas, Granville 'Danny' Young, David Harold Brown, Lloyd L. Tolbert, Paul Hanson, Lee Brownfield, Robert DeLapp, Tony Pope, Charles L. Campbell, Huey Lewis, Kiki Ebsen, Randy Feelgood, Hal Gausman, Deborah Harmon, Arthur Tovey, Ethel Sway, Janine King, Richard Patrick, Tom Tangen, Tom Willett",
            "title": "Back to the Future",
            "vote_average": 8.315,
            "wiki_url": "https://en.wikipedia.org/wiki/Back_to_the_Future",
            "writers": "Robert Zemeckis, Bob Gale"
        },
        "movie_card_419430": {
            "description": "Chris and his girlfriend Rose go upstate to visit her parents for the weekend. At first, Chris reads the family's overly accommodating behavior as nervous attempts to deal with their daughter's interracial relationship, but as the weekend progresses, a series of increasingly disturbing discoveries lead him to a truth that he never could have imagined.",
            "director": "Jordan Peele",
            "dop": "Denson Baker",
            "imdb_id": "5052448",
            "poster_path": "https://image.tmdb.org/t/p/original/tFXcEccSQMf3lfhfXKSU9iRBpa3.jpg",
            "release_date": "2017-02-24",
            "stars": "Daniel Kaluuya, Allison Williams, Bradley Whitford, Caleb Landry Jones, Stephen Root, Catherine Keener, Marcus Henderson, Betty Gabriel, LaKeith Stanfield, Lil Rel Howery, Ashley LeConte Campbell, John Wilmot, Caren L. Larkey, Julie Ann Doan, Rutherford Cravens, Geraldine Singer, Yasuhiko Oyama, Richard Herd, Erika Alexander, Jeronimo Spinx, Ian Casselberry, Trey Burvant, John Donohue, Sean Paul Braud, Zailand Adams, Keegan-Michael Key, Jordan Peele, Evan Shafran, Tahj Vaughans",
            "title": "Get Out",
            "vote_average": 7.6,
            "wiki_url": "https://en.wikipedia.org/wiki/Get_Out",
            "writers": "Jordan Peele"
        },
        "movie_card_458723": {
            "description": "Husband and wife Gabe and Adelaide Wilson take their kids to their beach house expecting to unplug and unwind with friends. But as night descends, their serenity turns to tension and chaos when some shocking visitors arrive uninvited.",
            "director": "Jordan Peele",
            "dop": "Mike Gioulakis",
            "imdb_id": "3581920",
            "poster_path": "https://image.tmdb.org/t/p/original/ux2dU1jQ2ACIMShzB3yP93Udpzc.jpg",
            "release_date": "2019-03-14",
            "stars": "Lupita Nyong'o, Winston Duke, Shahadi Wright Joseph, Evan Alex, Tim Heidecker, Elisabeth Moss, Cali Sheldon, Noelle Sheldon, Yahya Abdul-Mateen II, Anna Diop, Madison Curry, Duke Nicholson, Napiera Groves, Kara Hayward, Lon Gowan, Alan Frazier, Dustin Ybarra, Nathan Harrington, Darrel Cherney, James Cobb, Alessandro Garcia, David M Sandoval Jr., Ashley McKoy, Jordan Peele",
            "title": "Us",
            "vote_average": 6.973,
            "wiki_url": "https://en.wikipedia.org/wiki/Us",
            "writers": "Jordan Peele"
        }
    },
    "person_details": {
        "person_Daniel Kaluuya": {
            "biography": "Daniel Kaluuya (born February 24, 1989) is a British actor. Prominent both on screen and stage, he has received numerous accolades, including an Academy Award, two BAFTA Awards, and a Golden Globe Award.  Following supporting roles in the films Johnny English Reborn (2011), Kick-Ass 2 (2013), and Sicario (2015), as well as the Black Mirror episode \"Fifteen Million Merits\" (2011), Kaluuya had his breakout role in Jordan Peele's horror film Get Out, which garnered him a nomination for the Academy Award for Best Actor. This was followed by starring roles in Black Panther (2018), Widows (2018), Queen & Slim (2019), Nope (2022), and Spider-Man: Across the Spider-Verse (2023). For his portrayal of Black Panther Party leader Fred Hampton in Judas and the Black Messiah (2021), he won the BAFTA and Academy Award for Best Supporting Actor.",
            "birthday": "1989-02-24",
            "deathday": null,
            "movie_credits": [
                {
                    "popularity": 394.57,
                    "release_year": "2023",
                    "title": "Spider-Man: Across the Spider-Verse",
                    "vote_average": 8.38
                },
                {
                    "popularity": 66.606,
                    "release_year": "2022",
                    "title": "Nope",
                    "vote_average": 6.891
                },
                {
                    "popularity": 23.673,
                    "release_year": "2021",
                    "title": "Judas and the Black Messiah",
                    "vote_average": 7.347
                },
                {
                    "popularity": 14.933,
                    "release_year": "2019",
                    "title": "Queen & Slim",
                    "vote_average": 7.165
                },
                {
                    "popularity": 14.932,
                    "release_year": "2018",
                    "title": "Widows",
                    "vote_average": 6.491
                },
                {
                    "popularity": 54.932,
                    "release_year": "2018",
                    "title": "Black Panther",
                    "vote_average": 7.387
                },
                {
                    "popularity": 53.529,
                    "release_year": "2017",
                    "title": "Get Out",
                    "vote_average": 7.618
                },
                {
                    "popularity": 51.731,
                    "release_year": "2015",
                    "title": "Sicario",
                    "vote_average": 7.391
                },
                {
                    "popularity": 11.828,
                    "release_year": "2013",
                    "title": "Welcome to the Punch",
                    "vote_average": 5.9
                },
                {
                    "popularity": 25.907,
                    "release_year": "2013",
                    "title": "Kick-Ass 2",
                    "vote_average": 6.395
                },
                {
                    "popularity": 24.641,
                    "release_year": "2011",
                    "title": "Johnny English Reborn",
                    "vote_average": 6.226
                },
                {
                    "popularity": 7.657,
                    "release_year": "2010",
                    "title": "Chatroom",
                    "vote_average": 5.901
                },
                {
                    "popularity": 10.449,
                    "release_year": "2009",
                    "title": "Doctor Who: Planet of the Dead",
                    "vote_average": 7.4
                },
                {
                    "popularity": 7.19,
                    "release_year": "2008",
                    "title": "Cass",
                    "vote_average": 6.0
                }
            ],
            "name": "Daniel Kaluuya",
            "place_of_birth": "London, England, UK",
            "profile_path": "/a07Tqzgp0IrW9YkcOQiuKavP4tm.jpg"
        },
        "person_Denson Baker": {
            "biography": "Denson Baker is an award winning cinematographer of international feature films, music videos, documentaries and commercials. His recent credits include the feature film OPHELIA starring Daisy Ridley & Naomi Watts, MEASURE OF A MAN with Donald Sutherland, Judy Greer and Luke Wilson, the Working Title/BBC2 series THE LUMINARIES with Eva Green and Eve Hewson, SKY TV series DOMINA with Kasia Smutniak and Isabella Rossellini, UK TV series VICTORIA series II and he was the DP of the reshoots the Academy Award winning GET OUT which included the tone setting opening scene.\n\nHe has shot feature films and documentaries that have won awards and screened in most major international film festivals including Sundance, Cannes, Toronto, Venice, Tribecca, Clermont-Ferrand, Berlin, LA, among others. In 2005 Denson was accredited by the Australian Cinematographers Society allowing him the honour of having the letters ACS after his name. In 2015 he was accredited the New Zealand Cinematographers Society adding the honour of the letters NZCS.",
            "birthday": null,
            "deathday": null,
            "movie_credits": [],
            "name": "Denson Baker",
            "place_of_birth": null,
            "profile_path": "/1xjhPzprFavgqtz1Ua6xb7eRkfy.jpg"
        },
        "person_Jordan Peele": {
            "biography": "Jordan Haworth Peele (born February 21, 1979) is an American actor, comedian, and filmmaker. He is known for his film and television work in the comedy and horror genres. Peele started his career in sketch comedy before transitioning his career as a writer and director of psychological horror and satirical films. In 2017, Peele was included on the annual Time 100 list of the most influential people in the world.\n\nPeele's breakout role came in 2003, when he was hired as a cast member on the Fox sketch comedy series Mad TV, where he spent five seasons, leaving the show in 2008. In the following years, he and his frequent Mad TV collaborator, Keegan-Michael Key, created and starred in their own Comedy Central sketch comedy series Key & Peele (2012–2015). The series was critically acclaimed, winning two Primetime Emmy Awards and a Peabody Award. The two wrote, produced, and starred in the comedy film Keanu (2016) and appeared in various projects since.\n\nHis 2017 directorial debut, the horror film Get Out, was a critical and box office success, for which he received numerous accolades, including the Academy Award for Best Original Screenplay, along with nominations for Best Picture and Best Director. Critics have frequently named Get Out as one of the best films of the 21st century. He received another Academy Award nomination for Best Picture for producing Spike Lee's drama BlacKkKlansman (2018). He directed, wrote, and produced the acclaimed films Us (2019) and Nope (2022). He founded the film and television production company Monkeypaw Productions in 2012. He wrote and produced Candyman (2021), and Wendell and Wild (2022).\n\nPeele has also voice acted in the animated films Storks (2016), Captain Underpants: The First Epic Movie (2017) and Toy Story 4 (2019), as well as in the adult animated sitcom Big Mouth (2017–present). He co-created the TBS comedy series The Last O.G. (2018–2022) and the YouTube Premium comedy series Weird City (2019). He also served as the host and producer of the CBS All Access revival of the anthology series The Twilight Zone (2019–2020).",
            "birthday": "1979-02-21",
            "deathday": null,
            "movie_credits": [
                {
                    "popularity": 17.372,
                    "release_year": "2022",
                    "title": "The Bob's Burgers Movie",
                    "vote_average": 6.979
                },
                {
                    "popularity": 22.965,
                    "release_year": "2022",
                    "title": "Wendell & Wild",
                    "vote_average": 6.773
                },
                {
                    "popularity": 66.606,
                    "release_year": "2022",
                    "title": "Nope",
                    "vote_average": 6.891
                },
                {
                    "popularity": 34.976,
                    "release_year": "2019",
                    "title": "Us",
                    "vote_average": 6.973
                },
                {
                    "popularity": 79.427,
                    "release_year": "2019",
                    "title": "Toy Story 4",
                    "vote_average": 7.51
                },
                {
                    "popularity": 21.299,
                    "release_year": "2017",
                    "title": "Captain Underpants: The First Epic Movie",
                    "vote_average": 6.23
                },
                {
                    "popularity": 53.529,
                    "release_year": "2017",
                    "title": "Get Out",
                    "vote_average": 7.6
                },
                {
                    "popularity": 13.872,
                    "release_year": "2016",
                    "title": "Keanu",
                    "vote_average": 6.068
                },
                {
                    "popularity": 35.273,
                    "release_year": "2016",
                    "title": "Storks",
                    "vote_average": 6.636
                },
                {
                    "popularity": 18.422,
                    "release_year": "2012",
                    "title": "Wanderlust",
                    "vote_average": 5.52
                },
                {
                    "popularity": 23.612,
                    "release_year": "2010",
                    "title": "Little Fockers",
                    "vote_average": 5.647
                }
            ],
            "name": "Jordan Peele",
            "place_of_birth": "New York City, New York, USA",
            "profile_path": "/kFUKn5g3ebpyZ3CSZZZo2HFWRNQ.jpg"
        },
        "person_Michael J. Fox": {
            "biography": "Michael Andrew Fox OC (born June 9, 1961), known professionally as Michael J. Fox, is a Canadian-American retired actor. Beginning his career in the 1970s, he rose to prominence portraying Alex P. Keaton on the NBC sitcom Family Ties (1982–1989). Fox is famous for his role as protagonist Marty McFly in the Back to the Future film trilogy (1985–1990), a critical and commercial success. He went on to headline several films throughout the 1980s and 1990s, including Teen Wolf (1985), The Secret of My Success (1987), Casualties of War (1989), Doc Hollywood (1991), and The Frighteners (1996). Fox returned to television on the ABC sitcom Spin City in the lead role of Mike Flaherty from 1996 to 2000.\n\nIn 1998, Fox disclosed his 1991 diagnosis of Parkinson's disease. He subsequently became an advocate for finding a cure and founded the Michael J. Fox Foundation in 2000 to help fund research. Worsening symptoms forced Fox to reduce his activities and led to his return to television in Spin City when he was still a major movie star. He continued to make guest appearances on television, including recurring roles on the FX comedy-drama Rescue Me (2009) and the CBS legal drama The Good Wife (2010–2016) that garnered him critical acclaim. He voiced the lead roles in the Stuart Little films (1999–2005) and the animated film Atlantis: The Lost Empire (2001). His final major role was on the NBC sitcom The Michael J. Fox Show (2013–2014). Fox retired in 2020 due to his declining health.\n\nFox won five Primetime Emmy Awards, four Golden Globe Awards, two Screen Actors Guild Awards, and a Grammy Award. He was also appointed an Officer of the Order of Canada in 2010, along with being inducted to Canada's Walk of Fame in 2000 and the Hollywood Walk of Fame in 2002. For his advocacy of a cure for Parkinson's disease, he received an honorary doctorate in 2010 from the Karolinska Institute and an honorary Oscar in 2022.  This edit was made by FerrisMcFly",
            "birthday": "1961-06-09",
            "deathday": null,
            "movie_credits": [
                {
                    "popularity": 11.494,
                    "release_year": "2019",
                    "title": "See You Yesterday",
                    "vote_average": 5.578
                },
                {
                    "popularity": 13.49,
                    "release_year": "2016",
                    "title": "A.R.C.H.I.E.",
                    "vote_average": 6.103
                },
                {
                    "popularity": 37.146,
                    "release_year": "2014",
                    "title": "Annie",
                    "vote_average": 6.25
                },
                {
                    "popularity": 6.636,
                    "release_year": "2012",
                    "title": "Final Cut: Ladies and Gentlemen",
                    "vote_average": 7.6
                },
                {
                    "popularity": 13.928,
                    "release_year": "2005",
                    "title": "Stuart Little 3: Call of the Wild",
                    "vote_average": 5.198
                },
                {
                    "popularity": 15.49,
                    "release_year": "2002",
                    "title": "Interstate 60",
                    "vote_average": 7.369
                },
                {
                    "popularity": 24.462,
                    "release_year": "2002",
                    "title": "Stuart Little 2",
                    "vote_average": 5.751
                },
                {
                    "popularity": 23.811,
                    "release_year": "2001",
                    "title": "Atlantis: The Lost Empire",
                    "vote_average": 6.985
                },
                {
                    "popularity": 23.954,
                    "release_year": "1999",
                    "title": "Stuart Little",
                    "vote_average": 6.048
                },
                {
                    "popularity": 16.707,
                    "release_year": "1996",
                    "title": "The Frighteners",
                    "vote_average": 6.888
                },
                {
                    "popularity": 17.582,
                    "release_year": "1996",
                    "title": "Homeward Bound II: Lost in San Francisco",
                    "vote_average": 6.537
                },
                {
                    "popularity": 23.236,
                    "release_year": "1996",
                    "title": "Mars Attacks!",
                    "vote_average": 6.399
                },
                {
                    "popularity": 7.205,
                    "release_year": "1995",
                    "title": "Blue in the Face",
                    "vote_average": 6.6
                },
                {
                    "popularity": 15.749,
                    "release_year": "1995",
                    "title": "The American President",
                    "vote_average": 6.566
                },
                {
                    "popularity": 4.427,
                    "release_year": "1994",
                    "title": "Don't Drink the Water",
                    "vote_average": 5.589
                },
                {
                    "popularity": 10.23,
                    "release_year": "1994",
                    "title": "Greedy",
                    "vote_average": 6.156
                },
                {
                    "popularity": 11.05,
                    "release_year": "1993",
                    "title": "Life with Mikey",
                    "vote_average": 5.598
                },
                {
                    "popularity": 14.217,
                    "release_year": "1993",
                    "title": "Homeward Bound: The Incredible Journey",
                    "vote_average": 6.946
                },
                {
                    "popularity": 15.142,
                    "release_year": "1993",
                    "title": "For Love or Money",
                    "vote_average": 6.204
                },
                {
                    "popularity": 13.324,
                    "release_year": "1991",
                    "title": "Doc Hollywood",
                    "vote_average": 6.339
                },
                {
                    "popularity": 16.282,
                    "release_year": "1991",
                    "title": "The Hard Way",
                    "vote_average": 6.162
                },
                {
                    "popularity": 31.562,
                    "release_year": "1990",
                    "title": "Back to the Future Part III",
                    "vote_average": 7.467
                },
                {
                    "popularity": 17.524,
                    "release_year": "1989",
                    "title": "Casualties of War",
                    "vote_average": 7.1
                },
                {
                    "popularity": 32.997,
                    "release_year": "1989",
                    "title": "Back to the Future Part II",
                    "vote_average": 7.755
                },
                {
                    "popularity": 9.294,
                    "release_year": "1988",
                    "title": "Bright Lights, Big City",
                    "vote_average": 5.7
                },
                {
                    "popularity": 12.099,
                    "release_year": "1987",
                    "title": "The Secret of My Success",
                    "vote_average": 6.458
                },
                {
                    "popularity": 31.311,
                    "release_year": "1985",
                    "title": "Teen Wolf",
                    "vote_average": 6.173
                },
                {
                    "popularity": 65.086,
                    "release_year": "1985",
                    "title": "Back to the Future",
                    "vote_average": 8.315
                },
                {
                    "popularity": 11.896,
                    "release_year": "1982",
                    "title": "Class of 1984",
                    "vote_average": 6.386
                },
                {
                    "popularity": 5.109,
                    "release_year": "1980",
                    "title": "Midnight Madness",
                    "vote_average": 5.606
                }
            ],
            "name": "Michael J. Fox",
            "place_of_birth": "Edmonton, Alberta, Canada",
            "profile_path": "/2JB4FMgQmnhbBlQ4SxWFN9EIVDi.jpg"
        }
    }
}