{
    "movie_details": {
        "movie_card_13": {
            "description": "A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him.",
            "director": "Robert Zemeckis",
            "dop": "Don Burgess",
            "imdb_id": "0109830",
            "poster_path": "https://image.tmdb.org/t/p/original/arw2vcBveWOVZr6pxd9XTd1TdQa.jpg",
            "release_date": "1994-06-23",
            "stars": "Tom Hanks, Robin Wright, Gary Sinise, Sally Field, Mykelti Williamson, Michael Conner Humphreys, Hanna Hall, Haley Joel Osment, Siobhan Fallon Hogan, Rebecca Williams, Bob Penny, Harold G. Herthum, George Kelly, John Randall, Sam Anderson, Margo Moorer, Ione M. Telech, Christine Seabrook, John Worsham, Peter Dobson, Alexander Zemeckis, Logan Livingston Gomez, Ben Waddel, Elizabeth Hanks, Tyler Long, Christopher Jones, Grady Bowman, Kevin Mangan, Fay Genens, Frank Geyer, Rob Landry, Jason McGuire, Pete Auster, Sonny Shroyer, Brett Rice, Ed Davis, Daniel C. Striepeke, Bruce Lucvia, David Brisbin, Kirk Ward, Angela Lomas, Timothy Record, Deborah McTeer, Mark Matheisen, Al Harrington, Jed Gillin, Bob Harks, Don Fischer, Kenneth Bevington, Michael Flannery, Gary Robinson, Marlena Smalls, Kitty K. Green, Afemo Omilami, Matt Wallace, Danté McCarthy, Paulie DiCocco, Mike Jolly, Michael Kemmerling, John Voldstad, Jeffrey Winner, Russ Wilson, Daniel J. Gillooly, Calvin Gadsden, Aaron Izbicki, Michael Burgess, Steven Griffith, Bill Roberson, Michael McFall, Eric Underwood, Steve DeRelian, Byron Minns, Stephen Bridgewater, Bonnie Ann Burgess, Scott Oliver, John William Galt, Hilary Chaplain, Isabel Rose, Jay Ross, Richard D'Alessandro, Dick Stilwell, Kevin Davis, Michael Jace, Geoffrey Blake, Tim Perry, Vanessa Roth, Emily Carey, Paul Raczkowski, Valentine, Dick Cavett, Joe Stefanelli, Tiffany Salerno, Marla Sucharetza, Aloysius Gigl, Jack Bowden, Joe Alaskey, Lazarus Jackson, W. Benson Terry, Matt Rebenkoff, Peter Bannon, Joe Washington, Nora Dunfee, Natalie Hendrix Tate, Hallie D'Amore, Jim Hanks, Chiffonye Cobb, Juan Singleton, Bobby Richardson, Michael Mattison, Lenny Herb, Charles Boswell, Timothy McNeil, Lonnie Hamilton, Teresa Denton, Kurt Russell, Mary Ellen Trainor, Robb Skyler, Michael J. Oliver, Bryan Hanna, Greg Brown, Brendan Shanahan, Troy Christian, Jacqueline Lovell, Zach Hanner, Aaron Michael Lacey, William Shipman, Bob Hope",
            "title": "Forrest Gump",
            "tmdb_id": 13,
            "vote_average": 8.5,
            "wiki_url": "https://en.wikipedia.org/wiki/Forrest_Gump",
            "writers": "Winston Groom, Eric Roth"
        },
        "movie_card_155": {
            "description": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
            "director": "Christopher Nolan",
            "dop": "Wally Pfister",
            "imdb_id": "0468569",
            "poster_path": "https://image.tmdb.org/t/p/original/qJ2tW6WMUDux911r6m7haRef0WH.jpg",
            "release_date": "2008-07-16",
            "stars": "Christian Bale, Heath Ledger, Michael Caine, Gary Oldman, Aaron Eckhart, Maggie Gyllenhaal, Morgan Freeman, Nestor Carbonell, Monique Gabriela Curnen, Ron Dean, Chin Han, Eric Roberts, Ritchie Coster, Anthony Michael Hall, Keith Szarabajka, Joshua Harto, Melinda McGraw, Nathan Gamble, Michael Jai White, Colin McFarlane, Nydia Rodriguez Terracina, Tommy Lister Jr., William Fichtner, Cillian Murphy, Patrick Leahy, Matt Skiba, David Dastmalchian, Michael Vieau, Michael Stoyanov, William Smillie, Danny Goldring, Matthew O'Neill, Olumiji Olawumi, Greg Beam, Erik Hellman, Beatrice Rosen, Vincenzo Nicoli, Edison Chen, Andy Luther, James Farruggio, Tom McElroy, Will Zahrn, James Fierro, Sam Derence, Jennifer Knox, Patrick Clear, Sarah Jayne Dunn, Charles Venn, Winston Ellis, Sophia Hinshelwood, Keith Kupferer, Joseph Luis Caballero, Richard Dillane, Daryl Satcher, Chris Petschler, Aidan Feore, Philip Bulcock, Paul Birchard, Walter Lewis, Vincent Riotta, Nancy Crane, K. Todd Freeman, Matt Shallenberger, Michael Andrew Gorman, Lanny Lutz, Peter DeFaria, Matt Rippy, Andrew Bicknell, Ariyon Bakare, Doug Ballard, Helene Maksoud, Tommy Campbell, Craig Heaney, Lorna Gayle, Lisa McAllister, Peter Brooke, Joshua Rollins, Dale Rivera, Matthew Leitch, Thomas Gaitsch, William Armstrong, Adam Kalesperis, Tristan Tait, Bronson Webb, David Ajala, Gertrude Kyles, Jonathan Ryland, James Scales, Nigel Carrington, Ian Pirie, Lateef Lovejoy, Grahame Edwards, Roger Monk, Ronan Summers, Wai Wong, Michael Corey Foster, Hannah Gunn, Jon Lee Brody, Debbi Burns, Maritza Cabrera, Shirin Caiola, Laura Chernicky, Henry Milton Chu, Kelli Clevenger, Richard Divizio, Tony Domino, David Fultz, Natalie Hallam, Jordon Hodges, Erron Jay, Nicky Katt, Thomas Kosik, Don Kress, Tim Krueger, Dan Latham, Tom McComas, James Mellor, Joseph Oliveira, Buster Reeves, Peter Rnic, Amit Shah, Michelle Shields, Sofiya Smirnova, Bruce Spielbauer, Robert Patrick Stern, Robert Stone, Richard Strobel, Tom Townsend, John Turk, John Warman, Chris Wilson, Kevin Zaideman, Rob Clark, Brandon Lambdin, Craig Braginsky, Mike Whyte, Tina Simmons",
            "title": "The Dark Knight",
            "tmdb_id": 155,
            "vote_average": 8.514,
            "wiki_url": "https://en.wikipedia.org/wiki/The_Dark_Knight",
            "writers": "Christopher Nolan, Christopher Nolan, Jonathan Nolan, David S. Goyer, Bob Kane"
        },
        "movie_card_27205": {
            "description": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.",
            "director": "Christopher Nolan",
            "dop": "Wally Pfister",
            "imdb_id": "1375666",
            "poster_path": "https://image.tmdb.org/t/p/original/oYuLEt3zVCKq57qu2F8dT7NIa6f.jpg",
            "release_date": "2010-07-15",
            "stars": "Leonardo DiCaprio, Joseph Gordon-Levitt, Ken Watanabe, Tom Hardy, Elliot Page, Dileep Rao, Cillian Murphy, Tom Berenger, Marion Cotillard, Pete Postlethwaite, Michael Caine, Lukas Haas, Talulah Riley, Tohoru Masamune, Taylor Geare, Claire Geare, Johnathan Geare, Yuji Okumoto, Earl Cameron, Ryan Hayward, Miranda Nolan, Russ Fega, Tim Kelleher, Coralie Dedykere, Silvie Laguna, Virgile Bramly, Nicolas Clerc, Jean-Michel Dagory, Marc Raducci, Tai-Li Lee, Magnus Nolan, Helena Cullinan, Mark Fleischmann, Shelley Lang, Adam Cole, Jack Murray, Kraig Thornber, Angela Nathenson, Natasha Beaumont, Carl Gilliard, Jill Maddrell, Alex Lombard, Nicole Pulliam, Peter Basham, Michael Gaston, Felix Scott, Andrew Pleavin, Lisa Reynolds, Jason Tendell, Jack Gilroy, Shannon Welles, Daniel Girondeaud",
            "title": "Inception",
            "tmdb_id": 27205,
            "vote_average": 8.367,
            "wiki_url": "https://en.wikipedia.org/wiki/Inception",
            "writers": "Christopher Nolan"
        }
    },
    "person_details": {}
}