{
    "movie_details": {
        "movie_card_377": {
            "description": "Teenagers in a small town are dropping like flies, apparently in the grip of mass hysteria causing their suicides. A cop's daughter, Nancy Thompson, traces the cause to child molester Fred Krueger, who was burned alive by angry parents many years before. Krueger has now come back in the dreams of his killers' children, claiming their lives as his revenge. Nancy and her boyfriend, Glen, must devise a plan to lure the monster out of the realm of nightmares and into the real world...",
            "director": "Wes Craven",
            "dop": "Jacques Haitkin",
            "imdb_id": "0087800",
            "poster_path": "https://image.tmdb.org/t/p/original/wGTpGGRMZmyFCcrY2YoxVTIBlli.jpg",
            "release_date": "1984-11-09",
            "stars": "Heather Langenkamp, John Saxon, Ronee Blakley, Amanda Wyss, Jsu Garcia, Johnny Depp, Robert Englund, Charles Fleischer, Joseph Whipp, Lin Shaye, Joe Unger, Mimi Craven, Jack Shea, Ed Call, Sandy Lipton, David Andrews, Jeff Levine, Donna Woodrum, Shashawnee Hall, Carol Pritikin, Brian Reise, Ash Adams, Don Hannah, Leslie Hoffman, Paul Grenier, Kathi Gibbs, Chris Tashima, Antonia Yannouli, John Richard Petersen, Robert Shaye",
            "title": "A Nightmare on Elm Street",
            "vote_average": 7.328,
            "wiki_url": "https://en.wikipedia.org/wiki/A_Nightmare_on_Elm_Street",
            "writers": "Wes Craven"
        },
        "movie_card_493922": {
            "description": "When Ellen, the matriarch of the Graham family, passes away, her daughter's family begins to unravel cryptic and increasingly terrifying secrets about their ancestry.",
            "director": "Ari Aster",
            "dop": "Pawel Pogorzelski",
            "imdb_id": "7784604",
            "poster_path": "https://image.tmdb.org/t/p/original/p9fmuz2Oj3HtEJEqbIwkFGUhVXD.jpg",
            "release_date": "2018-06-07",
            "stars": "Toni Collette, Gabriel Byrne, Alex Wolff, Milly Shapiro, Ann Dowd, Mallory Bechtel, Brock McKinney, Jake Brown, Morgan Lund, Christy Summerhays, Bus Riley, Jarrod Phillips, Heidi Mendez, Zachary Arthur, David Stanley, Moises L. Tovar, Austin R. Grant, Gabriel Monroe Eckert, Harrison Nell, BriAnn Rachele, Ari Aster, Marilyn Miller, Mark Blockovich, Rachelle Hardy, Jason Miyagi, Lorenzo Silva, Alexis Long",
            "title": "Hereditary",
            "vote_average": 7.3,
            "wiki_url": "https://en.wikipedia.org/wiki/Hereditary_(film)",
            "writers": "Ari Aster"
        },
        "movie_card_694": {
            "description": "Jack Torrance accepts a caretaker job at the Overlook Hotel, where he, along with his wife Wendy and their son Danny, must live isolated from the rest of the world for the winter. But they aren't prepared for the madness that lurks within.",
            "director": "Stanley Kubrick",
            "dop": "John Alcott",
            "imdb_id": "0081505",
            "poster_path": "https://image.tmdb.org/t/p/original/9PtPnOJSH6pewElRlJPGqC5Gd3W.jpg",
            "release_date": "1980-05-23",
            "stars": "Jack Nicholson, Shelley Duvall, Danny Lloyd, Scatman Crothers, Philip Stone, Joe Turkel, Barry Nelson, Barry Dennen, Tony Burton, Lia Beldam, Billie Gibson, Lisa Burns, Louise Burns, David Baxt, Manning Redwood, Robin Pappas, Anne Jackson, Alison Coleridge, Burnell Tucker, Jana Shelden, Paul Desbois, Vivian Kubrick, Derek Lyons, Alan Harris, Peter McNamara, Guy Standeven, Reg Thomason",
            "title": "The Shining",
            "vote_average": 8.218,
            "wiki_url": "https://en.wikipedia.org/wiki/Shining",
            "writers": "Stanley Kubrick, Stephen King, Diane Johnson"
        }
    },
    "person_details": {
        "person_Stanley Kubrick": {
            "biography": "Stanley Kubrick (July 26, 1928 – March 7, 1999) was an American film director, writer, producer, and photographer who lived in England during most of the last four decades of his career. Kubrick was noted for the scrupulous care with which he chose his subjects, his slow method of working, the variety of genres he worked in, his technical perfectionism, and his reclusiveness about his films and personal life. He maintained almost complete artistic control, making movies according to his own whims and time constraints, but with the rare advantage of big-studio financial support for all his endeavors. Kubrick's films are characterized by a formal visual style and meticulous attention to detail—his later films often have elements of surrealism and expressionism that eschews structured linear narrative. His films are repeatedly described as slow and methodical, and are often perceived as a reflection of his obsessive and perfectionist nature. A recurring theme in his films is man's inhumanity to man. While often viewed as expressing an ironic pessimism, a few critics feel his films contain a cautious optimism when viewed more carefully.\n\nThe film that first brought him attention to many critics was Paths of Glory (1957), the first of three films of his about the dehumanizing effects of war. Many of his films at first got a lukewarm reception, only to be years later acclaimed as masterpieces that had a seminal influence on many later generations of film-makers. Considered especially groundbreaking was 2001: A Space Odyssey (1968) noted for being both one of the most scientifically realistic and visually innovative science-fiction films ever made while maintaining an enigmatic non-linear storyline. He voluntarily withdrew his film A Clockwork Orange (1971) from England, after it was accused of inspiring copycat crimes which in turn resulted in threats against Kubrick's family. His films were largely successful at the box-office, although Barry Lyndon (1975) performed poorly in the United States. Living authors Anthony Burgess and Stephen King were both unhappy with Kubrick's adaptations of their novels A Clockwork Orange and The Shining (1980) respectively, and both authors were engaged with subsequent adaptations. All of Kubrick's films from the mid-1950s to his death except for The Shining were nominated for Oscars, Golden Globes, or BAFTAs. Although he was nominated for an Academy Award as a screenwriter and director on several occasions, his only personal win was for the special effects in 2001: A Space Odyssey.\n\nEven though all of his films, apart from the first two, were adapted from novels or short stories, his works have been described by Jason Ankeny and others as \"original and visionary\". Although some critics, notably Andrew Sarris and Pauline Kael, frequently disparaged Kubrick's work, Ankeny describes Kubrick as one of the most \"universally acclaimed and influential directors of the postwar era\" with a \"standing unique among the filmmakers of his day.\"",
            "birthday": "1928-07-26",
            "deathday": "1999-03-07",
            "movie_credits": [
                {
                    "release_year": "1987",
                    "title": "Full Metal Jacket"
                },
                {
                    "release_year": "1999",
                    "title": "Eyes Wide Shut"
                },
                {
                    "release_year": "1968",
                    "title": "2001: A Space Odyssey"
                },
                {
                    "release_year": "1947",
                    "title": "Dreams That Money Can Buy"
                }
            ],
            "name": "Stanley Kubrick",
            "place_of_birth": "New York City, New York",
            "profile_path": "/exfQ6vXXq7rMS5YWb3B88PK39a1.jpg"
        },
        "person_Wes Craven": {
            "biography": "Wesley Earl \"Wes\" Craven (August 2, 1939 – August 30, 2015) was a prolific and influential American film director, writer, producer, and occasional actor known for his pioneering work in the horror genre, and particularly in the teen slasher subgenre. Among his best-known works are such landmark films as \"The Last House on the Left\" (1972), \"The Hills Have Eyes\" (1977), \"A Nightmare on Elm Street\" (1984) and the \"Scream\" series (1996–2011).",
            "birthday": "1939-08-02",
            "deathday": "2015-08-30",
            "movie_credits": [
                {
                    "release_year": "1996",
                    "title": "Scream"
                },
                {
                    "release_year": "1997",
                    "title": "Scream 2"
                },
                {
                    "release_year": "2000",
                    "title": "Scream 3"
                },
                {
                    "release_year": "2006",
                    "title": "Paris Je T'aime"
                },
                {
                    "release_year": "1994",
                    "title": "New Nightmare"
                },
                {
                    "release_year": "2001",
                    "title": "Jay and Silent Bob Strike Back"
                },
                {
                    "release_year": "2007",
                    "title": "Diary of the Dead"
                }
            ],
            "name": "Wes Craven",
            "place_of_birth": "Cleveland, Ohio, USA",
            "profile_path": "/eqwl6owrYykeTGTpKxwcAkbEJmg.jpg"
        }
    }
}